cases/hydrodynamics/irregular_waves-olaflow-5.0.0/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs ("libsampling.so");


interpolationScheme cellPoint;

setFormat       raw;

sets
(
    lineX1
    {
        type    uniform;
        axis    z;
        start   (7 0 0);
        end     (7 0 10);
        nPoints 100;
    }
    lineX2
    {
        type    uniform;
        axis    z;
        start   (10 0 0);
        end     (10 0 10);
        nPoints 100;
    }
    lineX3
    {
        type    uniform;
        axis    z;
        start   (15 0 0);
        end     (15 0 10);
        nPoints 100;
    }

);

fields          ( alpha.water );


// ************************************************************************* //
